usecase2/soap_request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ser="http://services.samples" xmlns:xsd="http://services.samples/xsd">
   <soap:Body>
     <ser:CorrelationID>1234</ser:CorrelationID>
   </soap:Body>
</soap:Envelope>
